app/controllers/colorstraps_controller.rb

SELECT  "colorstraps".* FROM "colorstraps" WHERE "colorstraps"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
  def show
    @color = Colorstrap.find(params[:id])

INSERT INTO "colorstraps" ("primary", "secondary", "success", "info", "warning", "danger", "created_at", "updated_at", "background", "text_light", "text_dark", "light", "dark", "link_hover", "form_background", "inner_background") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
  def create
    @color = Colorstrap.create(colorstrap_params)